print('pls inut your name:')
name=input()
#input函数接收到的为字符型数据，因此赋给name的也是字符数据；
#如果需要整形数据，需要使用int()函数转化
print('Hello',name, 'please give your answer:')
print('1024*748=',10248*768)


###########################################
#多行字符串
###########################################
#使用三引号可以只是一个多行的字符串，
#并且可以在三引号中自由使用单引号和双引号
#
print('''This is a multi-line string. This is the first line.
This is the second line.
"What's your name?," I asked.
He said "Bond, James Bond."
''')

#假设你想要在一个字符串中包含一个单引号（'），那么你该怎么指示这个字符串？
#例如，这个字符串是What's your name?。
#你肯定不会用'What's your name?'来指示它，
#因为Python会弄不明白这个字符串从何处开始，何处结束。
#所以，你需要指明单引号而不是字符串的结尾。
#可以通过 转义符 来完成这个任务。
#你用\'来指示单引号——注意这个反斜杠。
#现在你可以把字符串表示为'What\'s your name?'
#另一个表示这个特别的字符串的方法是"What's your name?"，即用双引号。
#类似地，要在双引号字符串中使用双引号本身的时候，也可以借助于转义符。
#################################################
#另外，你可以用转义符\\来指示反斜杠本身。
###################################################
#值得注意的一件事是，在一个字符串中，
#行末的单独一个反斜杠表示字符串在下一行继续，而不是开始一个新的行。
######################################################################
print('This is the first sentence.\
This is the second sentence.')
#可以看出其与使用''' '''效果相同
print('''This is the first sentence.\
This is the second sentence.''')

################################################
##################自然字符串###################
#如果你想要指示某些不需要如转义符那样的特别处理的字符串，那么你需要指定一个自
#然字符串。
####################################################
#自然字符串通过给字符串加上前缀r或R来指定。
####################################################
#例如r"Newlines are indicated by \n"。
print(r'new lines are indicated by the \n')
###################自然字符串和三引号指示字符串，可以省去大量的转义字符
########################
print('I\'m \"OK\"')
print('''I'm OK''')
print(r'I\'m OK')
print(r"I'm Ok")
#可以看出三引号相对最为好用
##################################
##########给正则表达式用户的注释 一定要用自然字符串处理正则表达式。
###否则会需要使用很多的反斜杠。例如，后向引用符可以写成'\\1'或r'\1'。
############Unicode################################
#Unicode是书写国际文本的标准方法。
#如果你想要用你的母语如北印度语或阿拉伯语写文本，(即除英语之外)
#那么你需要有一个支持Unicode的编辑器。
#类似地，Python允许你处理Unicode文本——你只需要在字符串前加上前缀u或U。
#例如，u"This is a Unicode string."。
############################################################
print(u'''this ia a 中文输出正常 code/decode test sentence. ''')
#######################################
#记住，在你处理文本文件的时候使用Unicode字符串，特别是当你知道这个文件含有用
#非纯英语的语言写的文本。
#######################################